const questions = [
  {
    question: "আপনি কতবার খুশি অনুভব করেন?",
    options: [
      { value: 5, text: "প্রায়ই" },
      { value: 0, text: "মাঝেমধ্যে" },
    ],
  },
  {
    question: "আপনি কি প্রায়ই উত্তেজনা ও আনন্দ অনুভব করেন?",
    options: [
      { value: 5, text: "প্রায়ই" },
      { value: 0, text: "মাঝেমধ্যে" },
    ],
  },
  {
    question: "আপনি কি আপনার জীবনে ভালো জিনিসগুলোর জন্য কৃতজ্ঞতা অনুভব করেন?",
    options: [
      { value: 5, text: "প্রায়ই" },
      { value: 0, text: "মাঝেমধ্যে" },
    ],
  },
  {
    question: "আপনি কি কখনও ঈর্ষান্বিত অনুভব করেন?",
    options: [
      { value: 0, text: "হ্যাঁ" },
      { value: 5, text: "না" },
    ],
  },
  {
    question: "আপনি কি নিজেকে ব্যস্ত রাখতে নতুন চ্যালেঞ্জ খুঁজে পান?",
    options: [
      { value: 5, text: "প্রায়ই" },
      { value: 0, text: "মাঝেমধ্যে" },
    ],
  },
  {
    question: "আপনি কি প্রিয় কাজগুলো করতে গিয়ে সময়ের হিসাব হারিয়ে ফেলেন?",
    options: [
      { value: 5, text: "প্রায়ই" },
      { value: 0, text: "মাঝেমধ্যে" },
    ],
  },
  {
    question: "আপনি কি কাজ করতে গিয়ে পুরোপুরি নিমজ্জিত থাকেন?",
    options: [
      { value: 5, text: "প্রায়ই" },
      { value: 0, text: "মাঝেমধ্যে" },
    ],
  },
  {
    question: "আপনি কি জনসমক্ষে নির্ভয়ে নাচতে পারেন?",
    options: [
      { value: 5, text: "হ্যাঁ" },
      { value: 0, text: "না" },
    ],
  },
  {
    question: "আপনার কি বন্ধু এবং পরিবারের সহায়তা আছে?",
    options: [
      { value: 5, text: "হ্যাঁ" },
      { value: 0, text: "না" },
    ],
  },
  {
    question:
      "আপনি কি এমন লোকদের সাথে মানসম্পন্ন সময় কাটান যারা আপনাকে অনুপ্রাণিত করে?",
    options: [
      { value: 5, text: "প্রায়ই" },
      { value: 0, text: "মাঝেমধ্যে" },
    ],
  },
  {
    question:
      "আপনি কি আপনার ভাবনা এবং অনুভূতি অন্যদের সাথে ভাগ করতে স্বাচ্ছন্দ্যবোধ করেন?",
    options: [
      { value: 5, text: "হ্যাঁ" },
      { value: 0, text: "না" },
    ],
  },
  {
    question: "আপনার কি একজন সঙ্গীর প্রয়োজন আছে?",
    options: [
      { value: 0, text: "হ্যাঁ" },
      { value: 5, text: "না" },
    ],
  },
  {
    question: "আপনি কি আপনার জীবনে লক্ষ্য এবং দিকনির্দেশনা অনুভব করেন?",
    options: [
      { value: 6, text: "হ্যাঁ" },
      { value: 0, text: "না" },
    ],
  },
  {
    question:
      "আপনি কি মনে করেন আপনার জীবনের দৈনন্দিন কর্মকাণ্ডের বাইরে আরও গভীর অর্থ রয়েছে?",
    options: [
      { value: 5, text: "হ্যাঁ" },
      { value: 0, text: "না" },
    ],
  },
  {
    question: "আপনি কি নেতিবাচক সময় সোশ্যাল মিডিয়াতে ব্যয় করেন?",
    options: [
      { value: 0, text: "হ্যাঁ" },
      { value: 5, text: "মাঝেমধ্যে" },
    ],
  },
  {
    question: "আপনি কি কলেজ/স্কুল/অফিসে যেতে পছন্দ করেন?",
    options: [
      { value: 5, text: "হ্যাঁ" },
      { value: 0, text: "না" },
    ],
  },
  {
    question: "আপনি কি কোনো বড় লক্ষ্য অর্জন করেছেন?",
    options: [
      { value: 5, text: "হ্যাঁ" },
      { value: 0, text: "না" },
    ],
  },
  {
    question: "আপনি কি মনে করেন আপনার বাবা-মা আপনার উপর গর্বিত?",
    options: [
      { value: 5, text: "হ্যাঁ" },
      { value: 0, text: "না" },
    ],
  },
  {
    question: "আপনি কি মনে করেন মানুষ আপনাকে সম্মান করে?",
    options: [
      { value: 5, text: "হ্যাঁ" },
      { value: 0, text: "না" },
    ],
  },
  {
    question: "আপনি কি মনে করেন আপনি এখন পর্যন্ত আপনার জীবনে ভালো কাজ করেছেন?",
    options: [
      { value: 5, text: "হ্যাঁ" },
      { value: 0, text: "না" },
    ],
  },
];
module.exports = questions;
