const questions = [
  {
    question: "तुम्ही किती वेळा आनंदी असता?",
    options: [
      { value: 5, text: "वारंवार" },
      { value: 0, text: "क्वचितच" },
    ],
  },
  {
    question: "तुम्हाला उत्साह आणि आनंदाची भावना वारंवार येते का?",
    options: [
      { value: 5, text: "वारंवार" },
      { value: 0, text: "क्वचितच" },
    ],
  },
  {
    question:
      "तुमच्या आयुष्यातील चांगल्या गोष्टींसाठी तुम्ही किती वेळा कृतज्ञ असता?",
    options: [
      { value: 5, text: "वारंवार" },
      { value: 0, text: "क्वचितच" },
    ],
  },
  {
    question: "कधी कधी तुम्हाला हेवा वाटतो का?",
    options: [
      { value: 0, text: "होय" },
      { value: 5, text: "नाही" },
    ],
  },
  {
    question: "तुम्ही स्वतःला गुंतवून ठेवण्यासाठी नवीन आव्हाने शोधता का?",
    options: [
      { value: 5, text: "वारंवार" },
      { value: 0, text: "क्वचितच" },
    ],
  },
  {
    question: "तुम्हाला आवडत्या गोष्टी करताना वेळेचा विसर पडतो का?",
    options: [
      { value: 5, text: "वारंवार" },
      { value: 0, text: "क्वचितच" },
    ],
  },
  {
    question: "तुम्ही करत असलेल्या कामात पूर्णपणे मग्न होता का?",
    options: [
      { value: 5, text: "वारंवार" },
      { value: 0, text: "क्वचितच" },
    ],
  },
  {
    question: "तुम्ही सार्वजनिक ठिकाणी निर्भयपणे नाचू शकता का?",
    options: [
      { value: 5, text: "होय" },
      { value: 0, text: "नाही" },
    ],
  },
  {
    question: "तुमच्याकडे मित्र आणि कुटुंबियांचे समर्थन आहे का?",
    options: [
      { value: 5, text: "होय" },
      { value: 0, text: "नाही" },
    ],
  },
  {
    question:
      "तुम्ही किती वेळा तुम्हाला प्रेरणा देणाऱ्या लोकांसोबत वेळ घालवता?",
    options: [
      { value: 5, text: "वारंवार" },
      { value: 0, text: "क्वचितच" },
    ],
  },
  {
    question:
      "तुमच्या विचार आणि भावना इतरांसोबत शेअर करण्यास तुम्ही किती वेळा आरामदायक वाटता?",
    options: [
      { value: 5, text: "होय" },
      { value: 0, text: "नाही" },
    ],
  },
  {
    question: "तुम्हाला जोडीदाराची गरज वाटते का?",
    options: [
      { value: 0, text: "होय" },
      { value: 5, text: "नाही" },
    ],
  },
  {
    question: "तुमच्या आयुष्यात उद्दिष्ट आणि दिशा आहे असे तुम्हाला वाटते का?",
    options: [
      { value: 6, text: "होय" },
      { value: 0, text: "नाही" },
    ],
  },
  {
    question:
      "दैनंदिन क्रियाकलापांव्यतिरिक्त तुमच्या आयुष्यात खोल अर्थ आहे असे तुम्हाला वाटते का?",
    options: [
      { value: 5, text: "होय" },
      { value: 0, text: "नाही" },
    ],
  },
  {
    question: "तुम्ही सोशल मीडियावर नकारात्मक वेळ घालवता का?",
    options: [
      { value: 0, text: "होय" },
      { value: 5, text: "क्वचितच" },
    ],
  },
  {
    question: "तुम्हाला महाविद्यालय/शाळा/कार्यालयात जायला आवडते का?",
    options: [
      { value: 5, text: "होय" },
      { value: 0, text: "नाही" },
    ],
  },
  {
    question: "तुम्ही कोणतेही मोठे लक्ष्य साध्य केले आहे का?",
    options: [
      { value: 5, text: "होय" },
      { value: 0, text: "नाही" },
    ],
  },
  {
    question: "तुमच्या पालकांना तुमचा अभिमान वाटतो असे तुम्हाला वाटते का?",
    options: [
      { value: 5, text: "होय" },
      { value: 0, text: "नाही" },
    ],
  },
  {
    question: "तुम्हाला वाटते का की लोक तुमचा सन्मान करतात?",
    options: [
      { value: 5, text: "होय" },
      { value: 0, text: "नाही" },
    ],
  },
  {
    question: "तुम्हाला असे वाटते का की आतापर्यंत तुम्ही चांगले काम केले आहे?",
    options: [
      { value: 5, text: "होय" },
      { value: 0, text: "नाही" },
    ],
  },
];
module.exports = questions;
