const questions = [
  {
    question: "आप कितनी बार खुद को खुश पाते हैं?",
    options: [
      { value: 5, text: "अक्सर" },
      { value: 0, text: "कभी-कभी" },
    ],
  },
  {
    question: "क्या आप अक्सर उत्साह और जोश का अनुभव करते हैं?",
    options: [
      { value: 5, text: "अक्सर" },
      { value: 0, text: "कभी-कभी" },
    ],
  },
  {
    question:
      "आप कितनी बार अपने जीवन की अच्छी चीजों के लिए आभारी महसूस करते हैं?",
    options: [
      { value: 5, text: "अक्सर" },
      { value: 0, text: "कभी-कभी" },
    ],
  },
  {
    question: "क्या आपको कभी-कभी ईर्ष्या होती है?",
    options: [
      { value: 0, text: "हां" },
      { value: 5, text: "नहीं" },
    ],
  },
  {
    question:
      "क्या आप खुद को व्यस्त रखने के लिए नई चुनौतियों की तलाश करते हैं?",
    options: [
      { value: 5, text: "अक्सर" },
      { value: 0, text: "कभी-कभी" },
    ],
  },
  {
    question:
      "जब आप ऐसी गतिविधियाँ कर रहे होते हैं जो आपको पसंद हैं, तो आप कितनी बार समय का ध्यान खो देते हैं?",
    options: [
      { value: 5, text: "अक्सर" },
      { value: 0, text: "कभी-कभी" },
    ],
  },
  {
    question: "आप कितनी बार अपने काम में पूरी तरह से डूब जाते हैं?",
    options: [
      { value: 5, text: "अक्सर" },
      { value: 0, text: "कभी-कभी" },
    ],
  },
  {
    question: "क्या आप सार्वजनिक रूप से निडर होकर नृत्य कर सकते हैं?",
    options: [
      { value: 5, text: "हां" },
      { value: 0, text: "नहीं" },
    ],
  },
  {
    question:
      "क्या आपको लगता है कि आपके पास दोस्तों और परिवार का समर्थन प्रणाली है?",
    options: [
      { value: 5, text: "हां" },
      { value: 0, text: "नहीं" },
    ],
  },
  {
    question:
      "आप कितनी बार उन लोगों के साथ गुणवत्तापूर्ण समय बिताते हैं जो आपको प्रेरित और उत्साहित करते हैं?",
    options: [
      { value: 5, text: "अक्सर" },
      { value: 0, text: "कभी-कभी" },
    ],
  },
  {
    question:
      "क्या आपको अपने विचारों और भावनाओं को दूसरों के साथ साझा करने में सहजता महसूस होती है?",
    options: [
      { value: 5, text: "हां" },
      { value: 0, text: "नहीं" },
    ],
  },
  {
    question: "क्या आपको लगता है कि आपको एक साथी की आवश्यकता है?",
    options: [
      { value: 0, text: "हां" },
      { value: 5, text: "नहीं" },
    ],
  },
  {
    question: "क्या आपको अपने जीवन में उद्देश्य और दिशा का अनुभव होता है?",
    options: [
      { value: 6, text: "हां" },
      { value: 0, text: "नहीं" },
    ],
  },
  {
    question:
      "क्या आपको लगता है कि आपका जीवन केवल दिन-प्रतिदिन की गतिविधियों से परे एक गहरा अर्थ रखता है?",
    options: [
      { value: 5, text: "हां" },
      { value: 0, text: "नहीं" },
    ],
  },
  {
    question: "क्या आप सोशल मीडिया पर नकारात्मक समय बिताते हैं?",
    options: [
      { value: 0, text: "हां" },
      { value: 5, text: "कभी-कभी" },
    ],
  },
  {
    question: "क्या आपको कॉलेज/स्कूल/ऑफिस जाना पसंद है?",
    options: [
      { value: 5, text: "हां" },
      { value: 0, text: "नहीं" },
    ],
  },
  {
    question: "क्या आपने कोई बड़े लक्ष्य हासिल किए हैं?",
    options: [
      { value: 5, text: "हां" },
      { value: 0, text: "नहीं" },
    ],
  },
  {
    question: "क्या आपको लगता है कि आपके माता-पिता आप पर गर्व करते हैं?",
    options: [
      { value: 5, text: "हां" },
      { value: 0, text: "नहीं" },
    ],
  },
  {
    question: "क्या आपको लगता है कि लोग आपका सम्मान करते हैं?",
    options: [
      { value: 5, text: "हां" },
      { value: 0, text: "नहीं" },
    ],
  },
  {
    question: "क्या आपको लगता है कि आपने अब तक अपने जीवन में अच्छा किया है?",
    options: [
      { value: 5, text: "हां" },
      { value: 0, text: "नहीं" },
    ],
  },
];

module.exports = questions;
